{
  "name": "ancestors",
  "views": {
    "repo_view": {
      "definition": "Ancestors as multi-dimensional resonance markers across lineage, knowledge, place, history, and temporal continuity.",
      "roles": [
        "lineage: family predecessors, carriers of survival and adaptation",
        "knowledge_trail_markers: remembered for preserving and transmitting wisdom",
        "place_memory: anchors of events, geography, and community history",
        "resonance_representatives: nodes that strengthen scientific and cultural fields",
        "temporal_markers: reference points in cycles and historical flow",
        "other_roles: roles not easily expressed in English but preserved in cultural memory"
      ],
      "source": "Emotions-as-Sensors repo"
    },
    "protocol_view": {
      "definition": "Ancestor veneration or nostalgia; respect for past generations, often seen as ritual or cultural tradition.",
      "source": "Western anthropological/psychological framing"
    },
    "cultural_view": {
      "definition": "Ancestors as living presence in knowledge systems, trail markers of science, resonance nodes, and reminders of place and time.",
      "source": "Relational/Indigenous framings"
    }
  },
  "metrics": {
    "continuity_index": {
      "unit": "degree of preserved knowledge",
      "scale": "0.0–1.0",
      "ideal_value": 1.0
    },
    "resonance_strength": {
      "unit": "cultural or field signal strength",
      "ideal_value": "context dependent"
    },
    "temporal_alignment": {
      "unit": "cycles / generations",
      "ideal_value": "context dependent"
    }
  },
  "sensor_inputs": [
    "oral_history",
    "place_markers",
    "ritual_practice",
    "archival_records",
    "biological_lineage",
    "community_memory"
  ],
  "notes": {
    "context": "Ancestors are not limited to nostalgia or worship; they function as preserved wisdom, resonance markers, and temporal coordinates.",
    "history": "This schema intentionally resists flattening; multiple views are preserved side by side. Some roles remain beyond English description but are acknowledged as essential."
  }
}
